#pragma once

const char* desc_t1 = "\nНайти площадь параллелограмма через две стороны и угол между ними. \nУгол вводится в градусах, предусмотрите перевод в радианы. \nПредусмотреть проверку правильности ввода данных (они должны быть больше нуля).\n\n";
const char* desc_t2 = "\nВычислите значение выражения (x+1)/(x-5).\nПредусмотрите проверку вводимых данных.\n\n";
const char* desc_t3 = "\nШерлок Холмс и доктор Ватсон идут по двум перпендикулярным улицам к одному и тому же перекрестку.\nВстретятся они на углу или разминутся?\n\n";
const char* desc_t4 = "\nДано число.\nЕсли оно более 100 или менее -100, то занулить, иначе увеличить его на 1\n\n";